reddit/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "WhWwd6UE9Bz6unLSA8cuNQ"], ["updated_at", "2018-11-20 22:32:08.059235"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!