reddit/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hey"], ["url", "aa.io"], ["content", "Welcome to the suck.\r\n"], ["author_id", 6], ["created_at", "2018-11-21 01:11:30.323672"], ["updated_at", "2018-11-21 01:11:30.323672"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save