reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "thanksgiving"], ["description", "cranberries and 5Ks"], ["moderator_id", 6], ["created_at", "2018-11-20 22:58:33.998290"], ["updated_at", "2018-11-20 22:58:33.998290"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find(params[:id])

SELECT "subs".* FROM "subs"
---
  def index
    @subs = Sub.all