reddit/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
   <label>Subs<br>
    <% Sub.all.each do |sub| %>